# VendorIdAttribute Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VendorIdAttribute Members
VendorIdAttribute Class Constructors Methods Properties See Also
---
The VendorIdAttribute type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| VendorIdAttribute | Constructs a new VendorIdAttribute. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Returns a value that indicates whether this instance is equal to a specified object. (Inherited from Attribute.) |
| GetHashCode | Returns the hash code for this instance. (Inherited from Attribute.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsDefaultAttribute | When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class. (Inherited from Attribute.) |
| Match | When overridden in a derived class, returns a value that indicates whether this instance equals a specified object. (Inherited from Attribute.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TypeId | When implemented in a derived class, gets a unique identifier for this Attribute. (Inherited from Attribute.) |
| Value | AddInId VendorId value. |

# See Also
VendorIdAttribute Class
Autodesk.Revit.DB.Macros Namespace